org/20220504155430-pension_funds_recycle_money.org
:PROPERTIES:
:ID:       adbc3c77-6196-4636-b768-a2098a9adf7c
:END:
#+TITLE: Pension funds recycle money
#+CREATED: [2022-05-04 Wed 15:54]
#+LAST_MODIFIED: [2022-05-04 Wed 15:55]

One thing that pension funds allow to do in the US is to capture part of people's savings in order to re-invest in the economy. Although pension funds are likely not /a good thing/ in absolute terms, I suppose they have a virtuous "money recycling" effect.

/Isn't that what the Circuit du Trésor was doing in France in a way?/
