20220504155430-pension_funds_recycle_money.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-23 Tue 22:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pension funds recycle money</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Pension funds recycle money</h1>
<p>
One thing that pension funds allow to do in the US is to capture part of people's savings in order to re-invest in the economy. Although pension funds are likely not <i>a good thing</i> in absolute terms, I suppose they have a virtuous "money recycling" effect.
</p>

<p>
<i>Isn't that what the Circuit du Trésor was doing in France in a way?</i>
</p>

<div id="outline-container-orgd584eba" class="outline-2">
<h2 id="orgd584eba">Links to this note</h2>
</div>
</div>
</body>
</html>
